In [17]:
import pandas as pd

### Pandas Series To Frame
Most people are comfortable working in DataFrame style objects. However, Pandas will also throw you a Series (quite often). In order to change your series into a DataFrame you call ".to_frame()"

Examples we'll run through:
1. Changing your Series into a DataFrame
2. Changing your Series into a DataFrame with a new name

Let's create two Series, one with a name, and one without

In [18]:
my_series_without_name = pd.Series([1, 2, 'e', pd.NA, 43, 'Bob'])
my_series_without_name

0       1
1       2
2       e
3    <NA>
4      43
5     Bob
dtype: object

In [19]:
my_series_with_name = pd.Series(['a', 45, pd.NA, 43, 'Sally', 87], name='my_series')
my_series_with_name

0        a
1       45
2     <NA>
3       43
4    Sally
5       87
Name: my_series, dtype: object

### 1. Changing your Series into a DataFrame
Let's change both of our series into DataFrames.

Notice how the one *without* a name has '0' as it's column name. The Series *with* a name has the series name as the column name

In [21]:
my_series_without_name.to_frame()

      0
0     1
1     2
2     e
3  <NA>
4    43
5   Bob

In [22]:
my_series_with_name.to_frame()

  my_series
0         a
1        45
2      <NA>
3        43
4     Sally
5        87

### 2. Changing your Series into a DataFrame with a new name
You may want to change the name of your new DataFrame column in general. By default it will be the Series name, but let's change it.

Here I'm going to call my new column 'my_new_df_column'

In [25]:
my_series_without_name.to_frame(name='my_new_df_column_no_name')

  my_new_df_column_no_name
0                        1
1                        2
2                        e
3                     <NA>
4                       43
5                      Bob

In [26]:
my_series_with_name.to_frame(name='my_new_df_column_with_name')

  my_new_df_column_with_name
0                          a
1                         45
2                       <NA>
3                         43
4                      Sally
5                         87